BO/lib/itaPHPSici/esempio-soap-request-REGISTRAPROTOCOLLO.txt

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mes="http://tempuri.org/ws_server/message/">
   <soapenv:Header/>
   <soapenv:Body>
      <mes:SICI_WEB_SERVICE soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <APPLICATIVO xsi:type="xsd:string">PRO</APPLICATIVO>
         <ENTE xsi:type="xsd:string">001</ENTE>
         <COD_UTENTE xsi:type="xsd:string">99</COD_UTENTE>
         <PASSWORD xsi:type="xsd:string">studiok</PASSWORD>
         <METODO xsi:type="xsd:string">REGISTRAPROTOCOLLO</METODO>
         <XML_PARAM xsi:type="xsd:string"><![CDATA[
<SEGNATURA_XML><?xml version="1.0" encoding="UTF-8"?>
<SegnaturaSK versione="2017-01-12" xml:lang="it">

	<Accompagnatoria>S</Accompagnatoria>
	<NumeroProtocolloDiProvenienza>1</NumeroProtocolloDiProvenienza>
	<DataRegistrazioneProtocolloDiProvenienza>2017-01-16</DataRegistrazioneProtocolloDiProvenienza>
	<Flusso>E</Flusso>
	<eMail>N</eMail>
  <Oggetto>Protocollo in entrata generato da PRO_WEB_SERVICES</Oggetto>

	<Mittente>
		<IndirizzoTelematico>erebuttini@studiok.it</IndirizzoTelematico>
		<Denominazione>Comune di Modena</Denominazione>
		<CodiceAmministrazione>c_f257</CodiceAmministrazione>
		<CodiceAOO>aooComu00</CodiceAOO>

		<Persona>
			<Denominazione>Emanuele Rebuttini</Denominazione>
			<CodiceFiscale>RBTMNL72A04F257X</CodiceFiscale>
		</Persona>

		<IndirizzoPostale>
			<Dug>Via</Dug>
			<Toponimo>Sancho Panza</Toponimo>
			<Civico>99</Civico>
			<CAP>41126</CAP>
			<Comune>Modena</Comune>
			<Provincia>MO</Provincia>
			<Nazione>IT</Nazione>
		</IndirizzoPostale>
	</Mittente>

	<Classificazioni>
		
		<Classificazione>
			<Categoria>15</Categoria>
			<Classe>1</Classe>
			<AnnoFascicolo>2017</AnnoFascicolo>
			<NumeroFascicolo>4</NumeroFascicolo>
			<Sottofascicolo>2</Sottofascicolo>
		</Classificazione>
	
		<Classificazione>
			<Categoria>15</Categoria>
			<Classe>1</Classe>
			<AnnoFascicolo>2017</AnnoFascicolo>
			<NumeroFascicolo>4</NumeroFascicolo>
			<Sottofascicolo>4</Sottofascicolo>
		</Classificazione>

	</Classificazioni>


  <Assegnazioni>
		<Assegnazione>
			<AssegnatoA>SET1</AssegnatoA>
			<AssegnatoDa>RESP1</AssegnatoDa>
		</Assegnazione>
	</Assegnazioni>


	<Documenti>

	  <Documento nome="CCD -  Specifiche tecniche dei servizi e delle interfacce del modello GeDoc v 1.0.pdf" principale="S" telematico="N" gdoc_id="105158" gdoc_appl="PRO" gdoc_vers="1">
	  	<DescrizioneDocumento>documento principale</DescrizioneDocumento>
	  </Documento>
	  
	  <Documento nome="ALLEGATO1.PDF" principale="N" telematico="N" gdoc_id="105253" gdoc_appl="PRO" gdoc_vers="1">
	  	<DescrizioneDocumento>Primo allegato</DescrizioneDocumento>
	  </Documento>
	  
	  <Documento nome="SDS Artists Oil Colour CHIP 4. 4 January 2011_1.pdf" principale="N" telematico="S" gdoc_id="" gdoc_appl="" gdoc_vers="">
	  	<DescrizioneDocumento>documento telematico</DescrizioneDocumento>
	  	<CollocazioneTelematica>http://www.daler-rowney.com/files/webform/pdf/SDS%20Artists%20Oil%20Colour%20CHIP%204.%204%20January%202011_1.pdf</CollocazioneTelematica>
	  	<Impronta algoritmo="SHA-256" codifica="base64">123456</Impronta>
	  </Documento>

	</Documenti>

</SegnaturaSK></SEGNATURA_XML>]]></XML_PARAM>
         <XML_RETURN xsi:type="xsd:string"></XML_RETURN>
         <MSG_RETURN xsi:type="xsd:string"></MSG_RETURN>
      </mes:SICI_WEB_SERVICE>
   </soapenv:Body>
</soapenv:Envelope>